In [ ]:
NAME : SAMIA ADAM HAMAD             REG NO : 31261/T.2023
ASSINGMENT 1     ISM 3

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('scores.csv')

In [3]:
#  (a)
# display the first 6 rows, and last 6 rows.
pd.concat([df.head(6), df.tail(6)])

,Stdno,Firstname,Lastname,sex,Program,Assign1,Assign2,Assign3,Test1,Test2,UE
0,100,Milana,Ferrell,Female,TE,50.4,86.1,72.3,84.4,86.5,84.2
1,101,Reo,Yoder,Female,TE,50.5,40.6,46.1,47.6,82.9,77.8
2,102,Romy,Wade,Male,BIT,38.7,28.8,98.9,59.3,77.1,35.0
3,103,Hiba,Santiago,Male,CEIT,46.0,69.6,92.3,86.0,22.8,65.0
4,104,Cataleya,Arroyo,Female,CS,83.4,57.7,80.8,90.0,44.3,31.3
5,105,Josh,Turnbull,Male,BIT,60.3,91.7,98.2,81.5,46.1,34.7
279,379,Cobie,Aguilar,Female,CEIT,33.8,45.6,83.1,47.0,23.2,33.2
280,380,Reanna,Hester,Female,TE,23.5,21.4,36.0,59.1,42.7,82.9
281,381,Jared,Lynch,Female,CS,88.7,53.1,37.5,79.4,29.8,80.0
282,382,Danyl,Gardner,Female,CS,29.0,46.1,67.1,41.7,46.5,77.4
283,383,Carina,Davis,Female,TE,64.6,47.5,82.7,92.4,30.7,64.2
284,384,Skyla,Davey,Female,TE,51.7,87.4,65.4,29.7,89.1,80.8

In [10]:
# (b)
# Display how many rows and how many columns are there in the dataframe in the
print("There ",df.shape[0], "are rows and",df.shape[1],  "columns in the dataframe")

There  285 are rows and 11 columns in the dataframe

In [11]:
# (c)
# Apply info() function to display information about the dataframe. From the display,
# the data type for Stdno column is integer. Change the datatype of Stdno to be string (i.e.
# object). Countercheck using df.dtypes to see if the data type of Stdno has been
# changed to string.

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 285 entries, 0 to 284
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Stdno      285 non-null    int64
 1   Firstname  285 non-null    object
 2   Lastname   285 non-null    object
 3   sex        285 non-null    object
 4   Program    285 non-null    object
 5   Assign1    285 non-null    float64
 6   Assign2    285 non-null    float64
 7   Assign3    285 non-null    float64
 8   Test1      285 non-null    float64
 9   Test2      285 non-null    float64
 10  UE         285 non-null    float64
dtypes: float64(6), int64(1), object(4)
memory usage: 24.6+ KB

In [12]:
df['Stdno'] = df['Stdno'].astype(str)

In [16]:
print(df['Stdno'].dtype)

object

In [17]:
 # (d_)
# Change the name of column sex (programmatically) so that the first letter starts
# with capital letter (i.e Sex). Then using columns attribute of dataframe, display
# columns names to see if the sex column starts with capital letter.
df.rename(columns={'sex': 'Sex'}, inplace=True)

In [18]:
df.columns

Index(['Stdno', 'Firstname', 'Lastname', 'Sex', 'Program', 'Assign1',
       'Assign2', 'Assign3', 'Test1', 'Test2', 'UE'],
      dtype='object')

In [29]:
#  (e)
# Using pandas insert function (read it from pandas manual and other
# resources), create a new column with the name Fullname (between Lastname and
# Sex columns) which contains the Firstname followed by a space followed by Lastname
# in
# Capital letters (Example: Joyce JUMA

df.insert(
    loc=df.columns.get_loc('Lastname') + 1,
    column='Fullname',
    value=df['Firstname'] + ' ' + df['Lastname'].str.upper()
)

In [30]:
df.head()

,Stdno,Firstname,Lastname,Fullname,Sex,Program,Assign1,Assign2,Assign3,Test1,Test2,UE
0,100,Milana,Ferrell,Milana FERRELL,Female,TE,50.4,86.1,72.3,84.4,86.5,84.2
1,101,Reo,Yoder,Reo YODER,Female,TE,50.5,40.6,46.1,47.6,82.9,77.8
2,102,Romy,Wade,Romy WADE,Male,BIT,38.7,28.8,98.9,59.3,77.1,35.0
3,103,Hiba,Santiago,Hiba SANTIAGO,Male,CEIT,46.0,69.6,92.3,86.0,22.8,65.0
4,104,Cataleya,Arroyo,Cataleya ARROYO,Female,CS,83.4,57.7,80.8,90.0,44.3,31.3

In [31]:
# (f)
# Create a new column with the name FM which contains the Final Mark (out of 100) for
# each student out of 100 in 2 decimal places. FM combines CA and UE. Display the first
# 5 records for the assignments, tests, CA and UE columns

df['CA'] = (
    df['Assign1'] * 0.08 + df['Assign2'] * 0.10 + df['Assign3'] * 0.12 +df['Test1'] * 0.32 +df['Test2'] * 0.38
)

In [32]:
df['FM'] = (df['CA'] * 0.40 + df['UE'] * 0.60).round(2)

In [33]:
df[['Assign1', 'Assign2', 'Assign3', 'Test1', 'Test2', 'CA', 'UE', 'FM']].head()

   Assign1  Assign2  Assign3  Test1  Test2      CA    UE     FM
0     50.4     86.1     72.3   84.4   86.5  81.196  84.2  83.00
1     50.5     40.6     46.1   47.6   82.9  60.366  77.8  70.83
2     38.7     28.8     98.9   59.3   77.1  66.118  35.0  47.45
3     46.0     69.6     92.3   86.0   22.8  57.900  65.0  62.16
4     83.4     57.7     80.8   90.0   44.3  67.772  31.3  45.89

In [35]:
# (g)
# Calculate and display minimum, maximum, and average for CA, UE and
# FM as shown below. Display the values in neat tabular form.
result = df[['CA', 'UE', 'FM']].agg(['min', 'max', 'mean'])

In [36]:
result

             CA         UE         FM
min   32.034000  30.100000  33.150000
max   90.476000  99.900000  92.070000
mean  61.767326  64.933333  63.666982

In [40]:
# (h)
# Using describe function on CA, UE and FM columns only, and also utilizing .iloc on
# the results to pick min, max and mean rows, display the results as shown in (i) above
# (in 2 decimal places) so that you can have a good comparison. Comment on the results
# obtained
result=df[['CA', 'UE', 'FM']].describe()
print(result)

               CA          UE          FM
count  285.000000  285.000000  285.000000
mean    61.767326   64.933333   63.666982
std     12.314881   19.733490   12.941336
min     32.034000   30.100000   33.150000
25%     53.226000   48.100000   52.810000
50%     61.304000   65.300000   64.880000
75%     70.130000   80.800000   73.580000
max     90.476000   99.900000   92.070000

In [42]:
show=result.iloc[[3,7,1]].round(2)
print(show)

         CA     UE     FM
min   32.03  30.10  33.15
max   90.48  99.90  92.07
mean  61.77  64.93  63.67

In [ ]:
# average og class score is grade B +

In [46]:
# (i)
# Using value_counts() function, display how many students have passed and how
# many have failed using following format where x stands for a number. The display will
# be given automatically by the function. The remark which has the highest number
# should come first).
# Pass x
# Fail x

df['Remark'] = df['FM'].apply(lambda x: 'Pass' if x >= 40 else 'Fail')
df['Remark'].value_counts()

Remark
Pass    274
Fail     11
Name: count, dtype: int64

In [47]:
# (j)
# Using groupby() function, display how many students have passed and how many
# have failed with their Sex in the following format where x stands for a number. For
# each group of Sex, it doesn’t matter whether Fail or Pass starts in the display.
df['Remark'] = df['FM'].apply(lambda x: 'Pass' if x >= 40 else 'Fail')
grouped = df.groupby('Sex')['Remark'].value_counts()
print(grouped)

Sex     Remark
Female  Pass      136
        Fail        4
Male    Pass      138
        Fail        7
Name: count, dtype: int64

In [48]:
# (k)
# Using groupby() function, display students failed and their grades for each Program

# First let grade the Final marks 
def assign_grade(fm):
    if 70 <= fm <= 100:
        return 'A'
    elif 60 <= fm < 70:
        return 'B+'
    elif 50 <= fm < 60:
        return 'B'
    elif 40 <= fm < 50:
        return 'C'
    elif 35 <= fm < 40:
        return 'D'
    else:
        return 'E'

df['Grade'] = df['FM'].apply(assign_grade)

In [49]:
# state which marks is considerder as fail   
failedStudents = df[df['FM'] < 40]

In [50]:
# grouped failed student by Program and grade score 
failed_grouped = failedStudents.groupby(['Program', 'Grade']).size()

In [51]:
print(failed_grouped)

Program  Grade
BIT      D        2
         E        1
CEIT     D        5
CS       D        1
TE       D        2
dtype: int64

In [54]:
# (l)
# Display the Fullname, Program, Final Mark and Grade for the first 3 best students in
# FM column. There is a number of possibilities. One of possibility is to use pandas
# nlargest function.
Beststudents = df.nlargest(3, 'FM')[['Fullname', 'Program', 'FM', 'Grade']]
print(Beststudents)

             Fullname Program     FM Grade
151  Michael MCGREGOR      CS  92.07     A
51        Sanna REYES      TE  89.47     A
135       Hal OSBORNE    CEIT  88.30     A

In [56]:
# (m)
# Display the Fullname, Program, FM and Grade for the best student from each Program. That
# means pick one best student from each Program.

bestPerProgram_idx = df.groupby('Program')['FM'].idxmax()
bestStudents = df.loc[bestPerProgram_idx, ['Fullname', 'Program', 'FM', 'Grade']]
bestStudents

             Fullname Program     FM Grade
15   Sarah-Jayne EAST     BIT  85.76     A
135       Hal OSBORNE    CEIT  88.30     A
151  Michael MCGREGOR      CS  92.07     A
51        Sanna REYES      TE  89.47     A

In [57]:
# (n)
# Display the Fullname, Program, FM, Grade and Remark for student(s) whose Lastname is
# typed from the keyboard. Note that there is a possibility of getting more than one student with
# that Lastname. The names entered should NOT be case sensitive. If the Lastname specified
# does not exist, display the message "Lastname …. specified does not exist". Test your code with
# (a) barker (b) Busby (c) Nowhere

In [59]:

lastname_input = input("Enter the Lastname to search: ").strip()
matches = df[df['Lastname'].str.lower() == lastname_input.lower()]

if not matches.empty:

    print(matches[['Fullname', 'Program', 'FM', 'Grade', 'Remark']])
else:
    print(f"Lastname '{lastname_input}' specified does not exist")

Enter the Lastname to search:  barker

          Fullname Program    FM Grade Remark
179    Kate BARKER      TE  37.7     D   Fail
219  Tayyib BARKER    CEIT  38.5     D   Fail

In [62]:
# (o)
# Display the Fullname, Sex, Program, Grade, and Remark for Male students from either CEIT or
# CS who Failed. Also display how many records are there, in the format: There are … records
# which meets the criteria

male_students = df['Sex'] == 'M'
program_filter = df['Program'].isin(['CEIT', 'CS'])
fail_filter = df['Remark'] == 'Fail'
filtered = df[male_students & program_filter & fail_filter]
result = filtered[['Fullname', 'Sex', 'Program', 'Grade', 'Remark']]
print(result)
print(f"There are {len(filtered)} records which meet the criteria")

Empty DataFrame
Columns: [Fullname, Sex, Program, Grade, Remark]
Index: []
There are 0 records which meet the criteria